# num = -10
# print(abs(num)) # نرجع القيمه المطلقه 
#----------------------------------------------
# num1 = 3.66
# print(round(num1)) # تقريب الارقام
#----------------------------------------------
# num3 = 3
# print(pow(num3 , 3)) # نرفع الرقم الي اس 
#----------------------------------------------
# number= 222 ,44 ,55,5555,6
# print(max(number)) # ايجاد اكبر قيمه في الداله
#----------------------------------------------
# print(sum(number)) # جمع الاعداد مع بعض في متغير واحد
#----------------------------------------------
# import math  # طلب الماث 
# num4 = 144
# print(math.sqrt(num4)) # للحساب الجذر
#----------------------------------------------
# import datetime # نستعيد التاريخ 
# day = datetime.date(2023 , 5, 4 ) # السنه بعدها الشهر بعدها اليوم 
# print(day) طباعة التاريخ 
#----------------------------------------------
# import datetime
# time = datetime.time(12 , 33 ,59) # الساعه 
# print(time)
#----------------------------------------------
# import datetime
# new = datetime.datetime.today() # طباعة اليوم والتاريخ بنفس اللحظه الزمنيه مهمه 
# print(new)
# print(new.year) # طباعة السنه اواي شىء ابيه
# print(new.day)
#----------------------------------------------
#_______هذا الدرس مهمه تحويل التاريخ الي نص___
import datetime
date = datetime.date(2023 , 5 , 13)
time = datetime.time(13 , 44 , 59 )
print(date)
print(time)
print(date.strftime('%A %B %Y'))
print(time.strftime("%I %M %S"))
# يوجد صوره توضح الحروف و التحويل 